Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: ezange
en: [GENERAL_NOUN] mine

source: ezikeere
en: [GENERAL_NOUN] pelican

source: etawaaza
en: [GENERAL_NOUN] See: ETABAAZA

source: etuutu
en: [GENERAL_NOUN] sweat, perspiration

source: etundubaale
en: [GENERAL_NOUN] tarpauline

source: evanjiri
en: [GENERAL_NOUN] the gospel

source: eviini
en: [GENERAL_NOUN] wine

source: ezaabbu
en: [GENERAL_NOUN] gold

source: ezi
en: [GENERAL_NOUN] those ones, which

source: ekikonderezo
en: [GENERAL_NOUN] a curse

source: ebikonderezo
en: [GENERAL_NOUN_PLURAL] curses

source: ekikangi
en: [GENERAL_NOUN] thorn of palm tree

source: ebikangi
en: [GENERAL_NOUN_PLURAL] thorn of palm trees

source: ekikayaabu
en: [GENERAL_NOUN] fish: Salted fish

source: ebikayaabu
en: [GENERAL_NOUN_PLURAL] fish: Salted fishes

source: ekikoba
en: [GENERAL_NOUN] peeled off skin

source: ebikoba
en: [GENERAL_NOUN_PLURAL] peeled off skins

source: ekikoijo
en: [GENERAL_NOUN] sugarcane

source: ebikoijo
en: [GENERAL_NOUN_PLURAL] sugarcanes

source: ekikomo
en: [GENERAL_NOUN] copper, large brass bracelet

source: ebikomo
en: [GENERAL_NOUN_PLURAL] copper, large brass bracelets

source: ekikondere
en: [GENERAL_NOUN] necklace of headwork

source: ebikondere
en: [GENERAL_NOUN_PLURAL] necklace of headworks

source: ekikondo
en: [GENERAL_NOUN] milestone

source: ebikondo
en: [GENERAL_NOUN_PLURAL] milestones

source: ekikongoijo
en: [COMMON_ANIMALS_NOUN] millipede

source: ebikongoijo
en: [COMMON_ANIMALS_NOUN_PLURAL] millipedes

source: ekikonko
en: [GENERAL_NOUN] empty maize cob

source: ebikonko
en: [GENERAL_NOUN_PLURAL] empty maize cobs

source: ekikoori
en: [GENERAL_NOUN] eye blow

source: ebikoori
en: [GENERAL_NOUN_PLURAL] eye blows

source: ekikorongezo
en: [GENERAL_NOUN] a torch

source: ebikorongezo
en: [GENERAL_NOUN_PLURAL] torches

source: ekikorwa
en: [GENERAL_NOUN] an act

source: ebikorwa
en: [GENERAL_NOUN_PLURAL] acts

source: ekikumu
en: [GENERAL_NOUN] toe or finger

source: ebikumu
en: [GENERAL_NOUN_PLURAL] toe or fingers

source: ekitindinda
en: [GENERAL_NOUN] snail, slug

source: ebitindinda
en: [GENERAL_NOUN_PLURAL] snail, slugs

source: ekitime
en: [GENERAL_NOUN] small piece of meat

source: ebitime
en: [GENERAL_NOUN_PLURAL] small piece of meats

source: ekitimatima
en: [GENERAL_NOUN] the last

source: ebitimatima
en: [GENERAL_NOUN_PLURAL] lasts

source: ekitiiri
en: [GENERAL_NOUN] anus, buttock

source: ebitiiri
en: [GENERAL_NOUN_PLURAL] anus, buttocks

source: ekiti
en: [GENERAL_NOUN] a piece of stick

source: ebiti
en: [GENERAL_NOUN_PLURAL] piece of sticks

source: ekitere
en: [COMMON_ANIMALS_NOUN] fatty tail of sheep

source: ebitere
en: [COMMON_ANIMALS_NOUN_PLURAL] fatty tail of sheeps

source: ekiteete
en: [GENERAL_NOUN] umoa grass

source: ebiteete
en: [GENERAL_NOUN_PLURAL] umoa grasses

source: ekiteekerezo
en: [GENERAL_NOUN] idea, thought

source: ebiteekerezo
en: [GENERAL_NOUN_PLURAL] idea, thoughts

source: ekitoijo
en: [GENERAL_NOUN] an offering to God

source: ebitoijo
en: [GENERAL_NOUN_PLURAL] offering to Gods

source: ekitoga
en: [GENERAL_NOUN] something young or imature

source: ebitoga
en: [GENERAL_NOUN_PLURAL] something young or imatures

source: ekitingwa
en: [GENERAL_NOUN] sexually loose

source: ebitingwa
en: [GENERAL_NOUN_PLURAL] sexually looses

source: ekitentere
en: [COMMON_ANIMALS_NOUN] a young grasshopper

source: ebitentere
en: [COMMON_ANIMALS_NOUN_PLURAL] young grasshoppers

source: ekitindiriro
en: [GENERAL_NOUN] millet drying rack

source: ebitindiriro
en: [GENERAL_NOUN_PLURAL] millet drying racks

source: ekiteetei
en: [GENERAL_NOUN] dress

source: ebiteetei
en: [GENERAL_NOUN_PLURAL] dresses

source: ekitenterezi
en: [GENERAL_NOUN] a kind of bird

source: ebitenterezi
en: [GENERAL_NOUN_PLURAL] kind of birds

source: ekitereza
en: [GENERAL_NOUN] soft straight hair

source: ebitereza
en: [GENERAL_NOUN_PLURAL] soft straight hairs

source: ekitiinisa
en: [GENERAL_NOUN] glory, honour, respect, reverence

source: ebitiinisa
en: [GENERAL_NOUN_PLURAL] glory, honour, respect, reverences

source: ekitinti
en: [GENERAL_NOUN] a patched garmen

source: ebitinti
en: [GENERAL_NOUN_PLURAL] patched garmens

source: ekitiyo
en: [GENERAL_NOUN] spade

source: ebitiyo
en: [GENERAL_NOUN_PLURAL] spades

source: ekyata-muzinga
en: [GENERAL_NOUN] honey-eating animal

source: ebyata-muzinga
en: [GENERAL_NOUN_PLURAL] honey-eating animals

source: ekyasa
en: [GENERAL_NOUN] century: a hundred years

source: ebyasa
en: [GENERAL_NOUN_PLURAL] century: a hundred yearses

source: ekoona
en: [GENERAL_NOUN] corner: a sharp bend

source: ekiziba
en: [GENERAL_NOUN] valley dam or pond

source: ebiziba
en: [GENERAL_NOUN_PLURAL] valley dam or ponds

source: ekiyengo
en: [GENERAL_NOUN] a small measuring basket

source: ebiyengo
en: [GENERAL_NOUN_PLURAL] small measuring baskets

source: ekitwaro
en: [GENERAL_NOUN] a big storage basket

source: ebitwaro
en: [GENERAL_NOUN_PLURAL] big storage baskets

source: ekituzi
en: [GENERAL_NOUN] mushroom:a large size mushroom

source: ebituzi
en: [GENERAL_NOUN_PLURAL] mushroom:a large size mushrooms

source: ekitumbwe
en: [GENERAL_NOUN] **unripe fruit.**

source: ebitumbwe
en: [GENERAL_NOUN_PLURAL] **unripe fruit.**s

source: ekisige
en: [GENERAL_NOUN] eye blows

source: ebisige
en: [GENERAL_NOUN_PLURAL] eye blowses

source: ekitooma
en: [GENERAL_NOUN] ficus tree

source: ebitooma
en: [GENERAL_NOUN_PLURAL] ficus trees

source: ekitontome
en: [GENERAL_NOUN] poem

source: ebitontome
en: [GENERAL_NOUN_PLURAL] poems

source: ekyenda
en: [GENERAL_NOUN] the stomach,intestine

source: ekyemo
en: [GENERAL_NOUN] physical stature

source: ebyemo
en: [GENERAL_NOUN_PLURAL] physical statures

source: ekyemerro
en: [GENERAL_NOUN] stature

source: ebyemerro
en: [GENERAL_NOUN_PLURAL] statures

source: ekyemeza
en: [GENERAL_NOUN] a self-propagated plant

source: ebyemeza
en: [GENERAL_NOUN_PLURAL] self-propagated plants

source: ekyekwaso
en: [GENERAL_NOUN] excuse

source: ebyekwaso
en: [GENERAL_NOUN_PLURAL] excuses

source: ekyekurra
en: [GENERAL_NOUN] a crawling thing

source: ebyekurra
en: [GENERAL_NOUN_PLURAL] crawling things

source: ekyegemera
en: [MATHEMATICS_NOUN] a set-square

source: ebyegemera
en: [MATHEMATICS_NOUN_PLURAL] set-squares

source: ekyebu
en: [GENERAL_NOUN] corner of cloth, skin

source: ebyebu
en: [GENERAL_NOUN_PLURAL] corner of cloth, skins

source: ekyeera
en: [GENERAL_NOUN] albino

source: ebyeera
en: [GENERAL_NOUN_PLURAL] albinos

source: ekyasha
en: [GENERAL_NOUN] a heart burn

source: ebyasha
en: [GENERAL_NOUN_PLURAL] heart burns

source: ekyate
en: [GENERAL_NOUN] a crack

source: ebyate
en: [GENERAL_NOUN_PLURAL] cracks

source: ekyasi
en: [GENERAL_NOUN] gap in the teeth

source: ebyasi
en: [GENERAL_NOUN_PLURAL] gap in the teeths

source: ekyaro
en: [GENERAL_NOUN] village, estate

source: ebyaro
en: [GENERAL_NOUN_PLURAL] village, estates

source: ekyarre
en: [COMMON_ANIMALS_NOUN] grass spread for cattle

source: ebyarre
en: [COMMON_ANIMALS_NOUN_PLURAL] grass spread for cattles

source: ekyaraani
en: [GENERAL_NOUN] sowing machine

source: ebyaraani
en: [GENERAL_NOUN_PLURAL] sowing machines

source: ekyara
en: [GENERAL_NOUN] finger, toe

source: ebyara
en: [GENERAL_NOUN_PLURAL] finger, toes

source: ekyano
en: [GENERAL_NOUN] hollow infront of neck

source: ebyano
en: [GENERAL_NOUN_PLURAL] hollow infront of necks

source: ekyanyuma
en: [GENERAL_NOUN] post, stamp

source: ebyanyuma
en: [GENERAL_NOUN_PLURAL] post, stamps

source: ekyange
en: [GENERAL_NOUN] mine

source: ebyange
en: [GENERAL_NOUN_PLURAL] mines

source: eky'ensekuro
en: [GENERAL_NOUN] pestle

source: eby'ensekuro
en: [GENERAL_NOUN_PLURAL] pestles

source: ekyambu
en: [GENERAL_NOUN] river

source: ebyambu
en: [GENERAL_NOUN_PLURAL] rivers

source: ekyalinga
en: [GENERAL_NOUN] worthless person, good-for-nothing

source: ebyalinga
en: [GENERAL_NOUN_PLURAL] worthless person, good-for-nothings

source: ekyambara
en: [COMMON_ANIMALS_NOUN] dog's collar

source: ebyambara
en: [COMMON_ANIMALS_NOUN_PLURAL] dog's collars

source: ekyakyo
en: [GENERAL_NOUN] flower,blossom

source: ebyakyo
en: [GENERAL_NOUN_PLURAL] flower,blossoms

source: ekyokunya
en: [GENERAL_NOUN] drink

source: ebyokunya
en: [GENERAL_NOUN_PLURAL] drinks

source: ekyahati/kirokinu
en: [GENERAL_NOUN] today

source: ebyahati
en: [GENERAL_NOUN_PLURAL] todays

source: ekyahanyuma
en: [GENERAL_NOUN] placenta, after birth

source: ebyahanyuma
en: [GENERAL_NOUN_PLURAL] placenta, after births

source: ekyadundu
en: [GENERAL_NOUN] pouch,crop

source: ebyadundu
en: [GENERAL_NOUN_PLURAL] pouch,crops

source: ekyadaadi
en: [GENERAL_NOUN] placenta, after birth

source: ebyadaadi
en: [GENERAL_NOUN_PLURAL] placenta, after births

source: ekyabuuramuti ekooti
en: [GENERAL_NOUN] cart, rickshaw coat, jacket

source: ebyabuuramuti ekooti
en: [GENERAL_NOUN_PLURAL] cart, rickshaw coat, jackets

source: ekufuru
en: [GENERAL_NOUN] lock, padlock

source: ekooko
en: [GENERAL_NOUN] cocoa fruit

source: ekondo
en: [GENERAL_NOUN] coronets

source: ekizizi
en: [GENERAL_NOUN] swarm

source: ebizizi
en: [GENERAL_NOUN_PLURAL] swarms

source: embaata
en: [COMMON_ANIMALS_NOUN] duck, goose

source: emanzi
en: [GENERAL_NOUN] a hero, brave person

source: emana
en: [GENERAL_NOUN] vagina

source: emamba
en: [GENERAL_NOUN] dawn, day break

source: emambo
en: [GENERAL_NOUN] pegs

source: emaaya
en: [COMMON_ANIMALS_NOUN] ostrich

source: edobo
en: [GENERAL_NOUN] pail, bucket

source: ekyoya
en: [GENERAL_NOUN] feather, hair

source: ebyoya
en: [GENERAL_NOUN_PLURAL] feather, hairs

source: ekyoto
en: [GENERAL_NOUN] fireplace, hearth

source: ebyoto
en: [GENERAL_NOUN_PLURAL] fireplace, hearths

source: ekyose
en: [GENERAL_NOUN] hair bracelet

source: ebyose
en: [GENERAL_NOUN_PLURAL] hair bracelets

source: ekyonzira
en: [GENERAL_NOUN] sacrifice

source: ebyonzira
en: [GENERAL_NOUN_PLURAL] sacrifices

source: ekyombo
en: [GENERAL_NOUN] sailing ship, dhow

source: ebyombo
en: [GENERAL_NOUN_PLURAL] sailing ship, dhows

source: ekyomuziro
en: [GENERAL_NOUN] forbidden thing

source: ebyomuziro
en: [GENERAL_NOUN_PLURAL] forbidden things

source: ekyombeko
en: [GENERAL_NOUN] building

source: ebyombeko
en: [GENERAL_NOUN_PLURAL] buildings

source: ekyokurwanisa
en: [GENERAL_NOUN] weapon

source: ebyokurwanisa
en: [GENERAL_NOUN_PLURAL] weapons

source: ekyokuhonga
en: [GENERAL_NOUN] offering

source: ebyokuhonga
en: [GENERAL_NOUN_PLURAL] offerings

source: ekyokujwara
en: [GENERAL_NOUN] garment, cloth

source: ebyokujwara
en: [GENERAL_NOUN_PLURAL] garment, cloths

source: ekyokoora
en: [GENERAL_NOUN] poison given by witchdoctors

source: ebyokoora
en: [GENERAL_NOUN_PLURAL] poison given by witchdoctorses

source: ekyohyo
en: [GENERAL_NOUN] temptation

source: ebyohyo
en: [GENERAL_NOUN_PLURAL] temptations

source: ekyeyo
en: [GENERAL_NOUN] broom

source: ebyeyo
en: [GENERAL_NOUN_PLURAL] brooms

source: ekyezigolezo
en: [GENERAL_NOUN] corner, turn, bend,curve

source: ebyezigolezo
en: [GENERAL_NOUN_PLURAL] corner, turn, bend,curves

source: ekyeyamura
en: [GENERAL_NOUN] yawn

source: ebyeyamura
en: [GENERAL_NOUN_PLURAL] yawns

source: ekyeya
en: [GENERAL_NOUN] a level plain

source: ebyeya
en: [GENERAL_NOUN_PLURAL] level plains

source: ekyetaago
en: [GENERAL_NOUN] a need

source: ebyetaago
en: [GENERAL_NOUN_PLURAL] needs

source: ekyetebuko
en: [GENERAL_NOUN] an echo

source: ebyetebuko
en: [GENERAL_NOUN_PLURAL] echos

source: ekyesweko
en: [GENERAL_NOUN] covering, blanket, sheet

source: ebyesweko
en: [GENERAL_NOUN_PLURAL] covering, blanket, sheets

source: ekyesomeko
en: [GENERAL_NOUN] coat, made-up garment, overal

source: ebyesomeko
en: [GENERAL_NOUN_PLURAL] coat, made-up garment, overals

source: ekyesingo
en: [GENERAL_NOUN] self-will

source: ebyesingo
en: [GENERAL_NOUN_PLURAL] self-wills

source: ekyesindiko
en: [GENERAL_NOUN] self-confidence, self-assurance,leisurely, stately walk

source: ebyesindiko
en: [GENERAL_NOUN_PLURAL] self-confidence, self-assurance,leisurely, stately walks

source: ekyesingiso
en: [GENERAL_NOUN] loofah, sponge

source: ebyesingiso/ekikuto/ekijumakuba
en: [GENERAL_NOUN_PLURAL] loofah, sponges

source: ekyesegenyu
en: [GENERAL_NOUN] strainer for water

source: ebyesegenyu
en: [GENERAL_NOUN_PLURAL] strainer for waters

source: ekyeremye
en: [GENERAL_NOUN] rebelliousness, disobedience

source: ebyeremye
en: [GENERAL_NOUN_PLURAL] rebelliousness, disobediences

source: ekyenyanja
en: [GENERAL_NOUN] fish

source: ebyenyanja
en: [GENERAL_NOUN_PLURAL] fishes

source: ekyokyezo
en: [GENERAL_NOUN] a burning place

source: ebyokyezo
en: [GENERAL_NOUN_PLURAL] burning places

source: eraihiriza
en: [GENERAL_VERB] to stand on tiptoe

source: eraoga
en: [GENERAL_VERB] to announce oneself

source: ereega
en: [GENERAL_VERB] to be taut, tightened

source: erinduka
en: [GENERAL_VERB] to wince, start

source: erora/kugezesa
en: [GENERAL_VERB] to examine or seeoneself

source: erabura
en: [GENERAL_VERB] to be insolent, inquisitive

source: erozaroza
en: [GENERAL_VERB] to pretend to search

source: esansara
en: [GENERAL_VERB] to scatter

source: esereka
en: [GENERAL_VERB] to hide oneself

source: esiga
en: [GENERAL_VERB] to trust, rely on

source: esiiga
en: [GENERAL_VERB] to smear oneself

source: esiikiriza
en: [GENERAL_VERB] to coveroneself, camouflage

source: esiitara
en: [GENERAL_VERB] to stumble, trip

source: esimba
en: [GENERAL_VERB] to become surety

source: esibiirra
en: [GENERAL_VERB] to stick on; insist

source: escra
en: [COMMON_ANIMALS_VERB] to give water (cattle)

source: esenguJa
en: [GENERAL_VERB] to settle on lees

source: eseemura
en: [GENERAL_VERB] to sneeze

source: esama
en: [GENERAL_VERB] to open the mouth

source: esagura
en: [GENERAL_VERB] to pillow one's self

source: kwimukya obusungu
en: [GENERAL_NOUN] raise ones grief

source: kugaita
en: [GENERAL_VERB] to mix with

source: kusereka
en: [GENERAL_VERB] to hide

source: erambira
en: [GENERAL_VERB] to lick up one's

source: erahiirra
en: [GENERAL_VERB] to make a vow

source: esingoleza
en: [GENERAL_VERB] to sweep idly

source: kufika
en: [GENERAL_VERB] to miss

source: esoka
en: [GENERAL_VERB] to gorge oneself

source: esonsogora
en: [GENERAL_VERB] to plume feathers, preen

source: esooboora
en: [GENERAL_VERB] to slink off

source: esorooza
en: [GENERAL_VERB] to assemble, come together

source: esungunika
en: [GENERAL_VERB] to keep to oneself

source: eta
en: [GENERAL_VERB] to call, invite

source: etaabya
en: [GENERAL_NOUN] intrude

source: etabaga
en: [GENERAL_NOUN] splash about

source: etabatabika
en: [GENERAL_VERB] to be mixed up

source: kwepana
en: [GENERAL_VERB] to dodge

source: eteega
en: [GENERAL_VERB] to gird oneself

source: eteekaniza
en: [GENERAL_VERB] to get ready, prepare

source: etendebeka
en: [GENERAL_VERB] to balance oneself

source: kuguruka
en: [GENERAL_VERB] to skip

source: kuhiga
en: [GENERAL_NOUN] go hunting alone

source: etiriginya
en: [GENERAL_VERB] to wriggle

source: eterega
en: [GENERAL_VERB] to gambol, skip

source: kujingjinga
en: [GENERAL_VERB] to skip, gambol

source: etembeeka
en: [GENERAL_VERB] to presume, take upon

source: kwececura
en: [GENERAL_VERB] to securitise, examine, understand

source: eteegura
en: [GENERAL_VERB] to ungird oneself

source: etanga
en: [GENERAL_VERB] to control oneself, refrain

source: etaba
en: [GENERAL_NOUN] toentangle oneself

source: esweka
en: [GENERAL_VERB] to cover oneself

source: esuusa
en: [GENERAL_VERB] to swing oneself

source: esungusura
en: [GENERAL_NOUN] go away alone

source: esoroora
en: [GENERAL_VERB] to separate oneself, withdraw

source: esokoora
en: [GENERAL_VERB] to clean, pick out

source: etooratoora
en: [GENERAL_VERB] to be handy, skilful

source: kwaralikira
en: [GENERAL_VERB] to worry, be anxious

source: eturumbwijura
en: [GENERAL_VERB] to be lazy, dawdle

source: eyahukaniza
en: [GENERAL_VERB] to separate oneself,exclude oneself

source: eyamura
en: [GENERAL_VERB] to yawn

source: eyiba
en: [GENERAL_VERB] to escape, slink off

source: eyiita
en: [GENERAL_VERB] to commit suicide

source: eyongosa
en: [GENERAL_VERB] to twist; go unwillingly

source: eyorobya
en: [GENERAL_VERB] to insinuate oneself,fawn

source: eyunguura
en: [GENERAL_VERB] to separate, disperse

source: ezinda
en: [GENERAL_VERB] to destroy oneself

source: ezinguurra
en: [GENERAL_VERB] to unwind oneself

source: eyobyo
en: [GENERAL_NOUN] Spider plant

source: eyagura
en: [GENERAL_VERB] to scratch oneself

source: etuuma
en: [GENERAL_VERB] to crowd together

source: eturubika
en: [GENERAL_VERB] to huddle oneself up

source: etunguurra
en: [GENERAL_VERB] to slip off

source: etooliikn
en: [GENERAL_VERB] to be skilful, romantic

source: ebikoreso
en: [GENERAL_NOUN] 1) materials. 2) utensils

source: ebijaburiro
en: [GENERAL_NOUN] fomentations

source: ebiino
en: [GENERAL_NOUN] large teeth

source: ebihera
en: [GENERAL_NOUN] odd numbers

source: ebicwanta
en: [GENERAL_NOUN] saliva

source: ebicooli
en: [GENERAL_NOUN] maize plant

source: ebicaani
en: [GENERAL_NOUN] campfire made for cows

source: ebbeeseni
en: [GENERAL_NOUN] a basin

source: ebbaibbuli
en: [GENERAL_NOUN] The Bible

source: ebbahaasa
en: [GENERAL_NOUN] envelope

source: ebirengeso
en: [GENERAL_NOUN] examinations or tests

source: ebicwanyagurika
en: [GENERAL_NOUN] **broken pieces**

source: ebigonzi
en: [GENERAL_NOUN] waves

source: ebihaburo
en: [GENERAL_NOUN] pieces of advice

source: ebihimba
en: [GENERAL_NOUN] beans

source: ebihwazi
en: [GENERAL_NOUN] impaired vision

source: ebiiga
en: [COMMON_ANIMALS_NOUN] swellings on cattle hips

source: ebijaga
en: [HEALTH_AND_MEDICINE_NOUN] syphilis

source: ebijenge
en: [GENERAL_NOUN] water-logged ground

source: ebitakuri
en: [GENERAL_NOUN] sweet potatoes

source: ebihya
en: [GENERAL_NOUN] new things

source: ebisingo
en: [GENERAL_NOUN] garden rubbish

source: ebisigarira
en: [GENERAL_NOUN] left-overs

source: ebisekule
en: [GENERAL_NOUN] food without salt

source: ebisa
en: [HEALTH_AND_MEDICINE_NOUN] labour pains

source: ebirwaniso
en: [GENERAL_NOUN] weapons

source: ebirungo
en: [GENERAL_NOUN] spices

source: ebirego
en: [GENERAL_NOUN] rumours

source: ebiraatwa
en: [GENERAL_NOUN] a pair of shoes

source: ebinyiga
en: [GENERAL_NOUN] saltless food or sauce

source: ebinyangabo
en: [GENERAL_NOUN] edible mushrooms

source: ebinyansi
en: [GENERAL_NOUN] weeds, tall grass

source: ebingonzi
en: [GENERAL_NOUN] water waves

source: ebimira
en: [GENERAL_NOUN] mucus from the nose

source: ebikya
en: [GENERAL_NOUN] neck

source: ebikwato
en: [GENERAL_NOUN] items touse, tools, implements

source: ebikuti
en: [GENERAL_NOUN] millet husks

source: ebikyenkya
en: [GENERAL_NOUN] pozzolan

source: ebindi
en: [GENERAL_NOUN] others: the rest

source: ebinyaanyindo
en: [GENERAL_NOUN] nasalised manner of speech

source: ebinyoobwa
en: [GENERAL_NOUN] groundnuts

source: ebinzaali
en: [GENERAL_NOUN] curry powder

source: ekirahure
en: [GENERAL_NOUN] sw.1) spectacles. 2) glasses

source: ebirahure
en: [GENERAL_NOUN_PLURAL] sw.1) spectacles. 2) glasseses

source: ebireju
en: [GENERAL_NOUN] beards

source: ebirika
en: [GENERAL_NOUN] snow

source: ebisosonkoro
en: [GENERAL_NOUN] empty match boxes

source: ebisurugutururu
en: [GENERAL_NOUN] ear wax

source: ekiigaana
en: [GENERAL_NOUN] shallow pool

source: ebiigaana
en: [GENERAL_NOUN_PLURAL] shallow pools

source: ekihwijo
en: [GENERAL_NOUN] fern, air freshener

source: ebihwijo
en: [GENERAL_NOUN_PLURAL] fern, air fresheners

source: ekihurro
en: [GENERAL_NOUN] creeper

source: ebihurro
en: [GENERAL_NOUN_PLURAL] creepers

source: ekihukuzi
en: [COMMON_ANIMALS_NOUN] a mole

source: ebihukuzi
en: [COMMON_ANIMALS_NOUN_PLURAL] moles

source: ekihongole
en: [GENERAL_NOUN] shade for calves

source: ebihongole
en: [GENERAL_NOUN_PLURAL] shade for calveses

source: ekihoiga
en: [GENERAL_NOUN] bit of grass

source: ebihoiga
en: [GENERAL_NOUN_PLURAL] bit of grasses

source: ekiho
en: [GENERAL_NOUN] haze, mist, fog

source: ebiho
en: [GENERAL_NOUN_PLURAL] haze, mist, fogs

source: ekihika
en: [GENERAL_NOUN] expectation, curiosity, longing for

source: ebihika
en: [GENERAL_NOUN_PLURAL] expectation, curiosity, longing fors

source: ebihiba
en: [GENERAL_NOUN] fresh beans

source: ekihangwa
en: [GENERAL_NOUN] a creature, created thing

source: ebihangwa
en: [GENERAL_NOUN_PLURAL] creature, created things

source: ekihanga
en: [GENERAL_NOUN] valley

source: ebihanga
en: [GENERAL_NOUN_PLURAL] valleys

source: ekihaha
en: [GENERAL_NOUN] a lung

source: ebihaha
en: [GENERAL_NOUN_PLURAL] lungs

source: ekigwo
en: [GENERAL_NOUN] a fall

source: ebigwo
en: [GENERAL_NOUN_PLURAL] falls

source: ekigugu
en: [GENERAL_NOUN] smell of burning food

source: ebigugu
en: [GENERAL_NOUN_PLURAL] smell of burning foods

source: ekigonzi
en: [GENERAL_NOUN] a wave

source: ekigurukano
en: [GENERAL_NOUN] occasionally; not often

source: ebigurukano
en: [GENERAL_NOUN_PLURAL] occasionally; not oftens

source: ekihuurika
en: [GENERAL_NOUN] an absent minded person

source: ebihuurika
en: [GENERAL_NOUN_PLURAL] absent minded persons

source: ekigwara
en: [GENERAL_NOUN] occasionally; not often

source: ebigwara
en: [GENERAL_NOUN_PLURAL] occasionally; not oftens

source: ekigogo
en: [GENERAL_NOUN] banana fibre

source: ebigogo
en: [GENERAL_NOUN_PLURAL] banana fibres

source: ekigono
en: [GENERAL_NOUN] the act of snoring

source: ebigono
en: [GENERAL_NOUN_PLURAL] act of snorings

source: ekigundu
en: [GENERAL_NOUN] the big one

source: ebigundu
en: [GENERAL_NOUN_PLURAL] big ones

source: ekigwererezi
en: [GENERAL_NOUN] accident, unexpected problem

source: ebigwererezi
en: [GENERAL_NOUN_PLURAL] accident, unexpected problems

source: ekihangara
en: [GENERAL_NOUN] palate

source: esahani
en: [GENERAL_NOUN_PLURAL] palates

source: ekihaso
en: [HEALTH_AND_MEDICINE_NOUN] pneumonia

source: ebihaso
en: [HEALTH_AND_MEDICINE_NOUN_PLURAL] pneumonias

source: ekihihi
en: [GENERAL_NOUN] cold, dull weather

source: ebihihi
en: [GENERAL_NOUN_PLURAL] cold, dull weathers

source: ekihoihorya
en: [COMMON_ANIMALS_NOUN] butterfly

source: ebihoihorya
en: [COMMON_ANIMALS_NOUN_PLURAL] butterflies

source: ekijuju
en: [GENERAL_NOUN] tsetsefly

source: ebijuju
en: [GENERAL_NOUN_PLURAL] tsetseflies

source: ekihooya
en: [GENERAL_NOUN] wound, sore

source: ebihooya
en: [GENERAL_NOUN_PLURAL] wound, sores

source: ekihururwa
en: [NATURE_AND_ENVIRONMENT_NOUN] climbing plant

source: ebihururwa
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] climbing plants

source: ekihuumuro
en: [GENERAL_NOUN] holiday,rest

source: ebihuumuro
en: [GENERAL_NOUN_PLURAL] holiday,rests

source: ekihyo
en: [GENERAL_NOUN] large knife, machete, sword

source: ebihyo
en: [GENERAL_NOUN_PLURAL] large knife, machete, swords

source: ekinyampo
en: [GENERAL_NOUN] passing air, a fart

source: ebinyampo
en: [GENERAL_NOUN_PLURAL] passing air, a farts

source: ekinyamakeka
en: [GENERAL_NOUN] civet-ca

source: ebinyamakeka
en: [GENERAL_NOUN_PLURAL] civet-cas

source: ekinyabwoya
en: [COMMON_ANIMALS_NOUN] a woolly caterpillar

source: ebinyabwoya
en: [COMMON_ANIMALS_NOUN_PLURAL] woolly caterpillars

source: ekinunko
en: [GENERAL_NOUN] bad smell

source: ebinunko
en: [GENERAL_NOUN_PLURAL] bad smells

source: ekintana
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] the queen termite

source: ebintana
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN_PLURAL] queen termites

source: ekiniga
en: [GENERAL_NOUN] anger

source: ebiniga
en: [GENERAL_NOUN_PLURAL] angers

source: ekingoleka
en: [GENERAL_NOUN] an idiot, an imbecile

source: ebingoleka
en: [GENERAL_NOUN_PLURAL] idiot, an imbeciles

source: ekinaga
en: [GENERAL_NOUN] cooking pot

source: ebinaga
en: [GENERAL_NOUN_PLURAL] cooking pots

source: ekimiro
en: [GENERAL_NOUN] a deep voice

source: ebimiro
en: [GENERAL_NOUN_PLURAL] deep voices

source: ekimera
en: [GENERAL_NOUN] a growing plant

source: ebimera
en: [GENERAL_NOUN_PLURAL] growing plants
